Revit 2027 API
AnalysisDisplayColoredSurfaceSettings(AnalysisDisplayColoredSurfaceSettings) Constructor
 Constructs a new copy of the input AnalysisDisplayColoredSurfaceSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayColoredSurfaceSettings(
	AnalysisDisplayColoredSurfaceSettings other
)
Public Sub New (
	other As AnalysisDisplayColoredSurfaceSettings
)
public:
AnalysisDisplayColoredSurfaceSettings(
	AnalysisDisplayColoredSurfaceSettings^ other
)
new :
        other : AnalysisDisplayColoredSurfaceSettings -> AnalysisDisplayColoredSurfaceSettings
Parameters
other AnalysisDisplayColoredSurfaceSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayColoredSurfaceSettings Class
AnalysisDisplayColoredSurfaceSettings Overload
Autodesk.Revit.DB.Analysis Namespace